//#region WARNING BAN WORDS
export const BanWordRegex =
  /^(([нn][иui1*][гg]{1,2}[aа@*])|([нn][иui1eе*][гg]{1,2}[eеaа@*]?[рpr])|([пnp][иui1*][dд][oо0*]?[рpr])|([пn][eе*]д[иui1]к)|(f[aа*]g[оo0*]t)|([гg][oо0*][mм][oо0*][cсs$][eе*][kк])|([гg][oо0*][mм][иui1*][kк])|(([xх]|\}\{)[oо0*]([xх]|\}\{)[oо0*][лl1])|(([xх]|\}\{)[aа@*][ч4])|((ж|\}\|\{)[иui*][дd])|([dд][aа@*][уyu*][nн])|([aа@*][yуu*][тt][иui1*][cсs$][тt])|([cсs$][иui1*][mм][пnpр])|([иui1*][нn]ц[eе*][лl])|([i1]n[cс][eе*][l1])|([ч4][eе*][рr][нn][oо0@*]?(([mм][aа@*][zз3])|((ж|\}\|\{)[oо0*][пnp])))|([ч4][иui1*][нn][kк])|([уy*][зz3][kк][oо0*][гg][лl1][aа@*][зz3])|([пnp][eеиui1*][нn][дd][oо0*][cсs$]))$/i;
//#endregion

//#region Another
//#endregion
