//#region WARNING BAN WORDS

export const BanWordRegex =
  /^(([нn]+[eе*иui1!]+[gгрp]+[иui1аaeе@*]*[рpr]*)|([пnрp]+[иueеi1!*]+[дd]+[иuоo0@]*[рprkк]+)|([fф]+[aа@*]+[gг]+[оo0*]+[tт]+)|([гg]+[оo0*]+[мm]+[иui1!]*[оo0]*[sсc$]*[eе*]*[кk]+)|(([xх]|(\}\{))+[оo0*]+([xх]|(\}\{))+[оo0*]+[лl1!]+)|(([xх]|(\}\{))+[aа@*]+[ч4]+[ьb]*)|((ж|(\}\|\{))+[иui!*]+[dд]+)|([dд]+[aа@*]+[уy*]+[нn]+)|([aа@*]+[yу*]+[тt]+[иui1!*]+[сcs$]+[tт]+)|([scс]+[иui1!]+[мm]+[пnрp]+)|([иui1!*]+[нn]+[цcс]+[eе*]+[лl1!]+)|([ч4]+[eе*]+[рpr]+[нn]+[оo0*@](([мm]+[aа@*]*[зz3]+[ы*]*й*)|(ж+[оo0*@]+[пnрp]+[ы*]*й*)))|([ч4]+[иui1!*]+[нn]+[кk]+)|([уy*]+[зz3]+[кk]+[оo0*]+[гg]+[лl1!]+[aа@*]+[зz3]+[ы*]*й*)|([пnрp]+[иueеi1!*]+[нn]+[dд]+[oо0*]+[сcs$]+))$/i;
//#endregion

//#region Another
//#endregion
